kristiangoystdal/Audio_Watermark_Generator/STM32/Core/Src/main.c
// Function to generate sine wave lookup table for low frequency
void get_sineval_low(void) {
  for (int i = 0; i < MAX_SAMPLES_LOW; i++) {
    sine_val_low[i] =
        (uint16_t)((4095.0 / 2.0) *
                   (1.0 + sinf(2.0 * pi * i / MAX_SAMPLES_LOW) * (1.5 / 1.65)));
  }
}

// Function to generate sine wave lookup table for the high frequency
void get_sineval_high(void) {
  for (int i = 0; i < MAX_SAMPLES_HIGH; i++) {
    sine_val_high[i] = (uint16_t)((4095.0 / 2.0) *
                                  (1.0 + sinf(2.0 * pi * i / MAX_SAMPLES_HIGH) *
                                             (1.5 / 1.65)));
  }
}

// Function to generate mid-scale lookup table
void get_dc_mid(void) {
  for (int i = 0; i < MAX_SAMPLES_MID_VAL; ++i)
    dc_mid[i] = MID_12B;
}

uint32_t get_dac_sample_rate_hz(void) {
  uint32_t tim_clk = HAL_RCC_GetPCLK1Freq();
  if ((RCC->CFGR & RCC_CFGR_PPRE1) != RCC_CFGR_PPRE1_DIV1)
    tim_clk *= 2; // timer clock doubled if APB prescaler != 1

  return tim_clk / ((htim2.Init.Prescaler + 1) * (htim2.Init.Period + 1));
}

// Function to calculate the total time it takes to send the bitstream
void calculate_pulse_time(void) {
  fs = get_dac_sample_rate_hz();

  float f_0 = (float)fs / (float)MAX_SAMPLES_LOW;
  float f_1 = (float)fs / (float)MAX_SAMPLES_HIGH;

  f_0_bit_duration = (float)PERIODS_PER_BIT_LOW / f_0;
  f_1_bit_duration = (float)PERIODS_PER_BIT_HIGH / f_1;

  // Exact bitstream time
  total_time = 0.0f;
  for (int i = 0; i < BITSTREAM_LENGTH; ++i) {
    if (bitstream[i] == 0) {
      total_time += ((float)PERIODS_PER_BIT_LOW) / f_0;
    } else if (bitstream[i] == 1) {
      total_time += (float)PERIODS_PER_BIT_HIGH / f_1;
    }
  }

  // Add silence time
  total_time *= 1.05f;                            // 5% margin
  total_time += cable_speaker_delay_ms / 1000.0f; // 10ms margin

  // Convert to ticks using the PSC already set for TIM8
  uint32_t tim8_clk = HAL_RCC_GetPCLK2Freq();
  if ((RCC->CFGR & RCC_CFGR_PPRE2) != RCC_CFGR_PPRE2_DIV1)
    tim8_clk *= 2U;
  tick_hz = (double)tim8_clk / (double)(htim8.Init.Prescaler + 1U);

  arr = __HAL_TIM_GET_AUTORELOAD(&htim8);
  ticks = (uint32_t)llround(total_time * tick_hz);

  pulse_time = ticks;
  __HAL_TIM_SET_COMPARE(&htim8, TIM_CHANNEL_1, pulse_time);
}

// Function to fill a buffer with repeated patterns from a lookup table
static inline void fill_lut_repeated(uint16_t *dst, size_t buffer_len,
                                     const uint16_t *lut, size_t lut_len) {
  size_t k = 0;
  while (k < buffer_len) {
    size_t to_copy = (buffer_len - k < lut_len) ? (buffer_len - k) : lut_len;
    memcpy(&dst[k], lut, to_copy * sizeof(uint16_t));
    k += to_copy;
  }
}

// Function to fill half of the output buffer based on the current bit
static inline void fill_half(uint16_t *dst, uint32_t bit) {
  if (bit == 2) {
    for (size_t i = 0; i < MAX_NUM_SAMPLES_BUFFER; ++i)
      dst[i] = MID_12B;
  } else if (bit == 1) {
    fill_lut_repeated(dst, MAX_NUM_SAMPLES_BUFFER, sine_val_high,
                      MAX_SAMPLES_HIGH); // 16×
  } else {
    fill_lut_repeated(dst, MAX_NUM_SAMPLES_BUFFER, sine_val_low,
                      MAX_SAMPLES_LOW); // 15×
  }
}

// DAC conversion complete callbacks for half buffer
void HAL_DAC_ConvHalfCpltCallbackCh1(DAC_HandleTypeDef *hdac) {
  if (!tx_active)
    return;

  // Update current period
  uint32_t per = (current_bit == 0)   ? PER_HALF_LOW
                 : (current_bit == 1) ? PER_HALF_HIGH
                                      : PER_HALF_SIL;

  current_period += per;

  // Check if we need to move to the next bit
  while ((current_bit == 0 && current_period >= PERIODS_PER_BIT_LOW) ||
         (current_bit == 1 && current_period >= PERIODS_PER_BIT_HIGH) ||
         (current_bit == 2 && current_period >= PERIODS_PER_BIT_SIL)) {
    current_period = 0;
    current_idx = (current_idx + 1) % BITSTREAM_LENGTH;
    current_bit = bitstream[current_idx];
  }

  // Fill the first half of the buffer based on the current bit
  fill_half((uint16_t *)&output_buffer[0], current_bit);
}

// DAC conversion complete callback for the full buffer
void HAL_DAC_ConvCpltCallbackCh1(DAC_HandleTypeDef *hdac) {
  if (!tx_active)
    return;

  // Update current period
  uint32_t per = (current_bit == 0)   ? PER_HALF_LOW
                 : (current_bit == 1) ? PER_HALF_HIGH
                                      : PER_HALF_SIL;

  current_period += per;

  // Check if we need to move to the next bit
  while ((current_bit == 0 && current_period >= PERIODS_PER_BIT_LOW) ||
         (current_bit == 1 && current_period >= PERIODS_PER_BIT_HIGH) ||
         (current_bit == 2 && current_period >= PERIODS_PER_BIT_SIL)) {
    current_period = 0;
    current_idx = (current_idx + 1) % BITSTREAM_LENGTH;
    current_bit = bitstream[current_idx];
  }

  // Fill the first half of the buffer based on the current bit
  fill_half((uint16_t *)&output_buffer[MAX_NUM_SAMPLES_BUFFER], current_bit);
}

void reset_dac(void) {
  // Stop DAC DMA
  HAL_DAC_Stop_DMA(&hdac1, DAC_CHANNEL_1);

  // Restart the bitstream from the beginning
  current_idx = 0;
  current_period = 0;
  current_bit = bitstream[0];

  // Prefill both halves of the circular buffer with the first bit
  fill_half((uint16_t *)&output_buffer[0], current_bit);
  fill_half((uint16_t *)&output_buffer[MAX_NUM_SAMPLES_BUFFER], current_bit);

  __HAL_TIM_SET_COUNTER(&htim2, 0);
  HAL_TIM_Base_Start(&htim2);

  tx_active = true;

  // Restart DAC with the circular buffer
  HAL_DAC_Start_DMA(&hdac1, DAC_CHANNEL_1, (uint32_t *)output_buffer,
                    2 * MAX_NUM_SAMPLES_BUFFER, DAC_ALIGN_12B_R);
}

// Timer interrupt callback for TIM8
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim) {
  if (htim->Instance == TIM8) {
    update_time_temperature();
    if (first_run && now.minutes != STARTING_MINUTE && ENABLE_DELAYED_START) {
      counter = INTERVAL_BETWEEN_REPEATS_MINUTES;
      HAL_DAC_Start(&hdac1, DAC_CHANNEL_1);
      HAL_DAC_SetValue(&hdac1, DAC_CHANNEL_1, DAC_ALIGN_12B_R, MID_12B);
      return;
    } else {
      first_run = false;
      if (!USE_DEFAULT_INTERVAL_BETWEEN_REPEATS) {
        counter++;
        if (counter >= INTERVAL_BETWEEN_REPEATS_MINUTES) {
          counter = 0;

          if (USE_SPEAKER_TRANSMISSION) {
            HAL_GPIO_WritePin(GPIOA, GPIO_PIN_7, GPIO_PIN_SET);
          }
          if (USE_CABLE_TRANSMISSION) {
            HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_SET);
          }
          if (USE_CABLE_TRANSMISSION || USE_SPEAKER_TRANSMISSION) {
            DWT_Delay_ms(cable_speaker_delay_ms);
          }
          if (USE_CABLE_TRANSMISSION) {
            HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_RESET);
          }

          update_time_temperature();
          update_input_string();
          make_bitstream_from_string(input_string);
          calculate_pulse_time();
          reset_dac();
        }
      } else {

        if (USE_SPEAKER_TRANSMISSION) {
          HAL_GPIO_WritePin(GPIOA, GPIO_PIN_7, GPIO_PIN_SET);
        }
        if (USE_CABLE_TRANSMISSION) {
          HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_SET);
        }
        if (USE_CABLE_TRANSMISSION || USE_SPEAKER_TRANSMISSION) {
          DWT_Delay_ms(cable_speaker_delay_ms);
        }
        if (USE_CABLE_TRANSMISSION) {
          HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_RESET);
        }
        update_time_temperature();
        update_input_string();
        make_bitstream_from_string(input_string);
        calculate_pulse_time();
        reset_dac();
      }
    }
  }
}

void HAL_TIM_PWM_PulseFinishedCallback(TIM_HandleTypeDef *htim) {
  if (htim->Instance == TIM8 && htim->Channel == HAL_TIM_ACTIVE_CHANNEL_1) {
    if (USE_SPEAKER_TRANSMISSION) {
      HAL_GPIO_WritePin(GPIOA, GPIO_PIN_7, GPIO_PIN_RESET);
    }
    if (USE_CABLE_TRANSMISSION) {
      HAL_GPIO_WritePin(GPIOA, GPIO_PIN_6, GPIO_PIN_SET);
      DWT_Delay_ms(100);
      HAL_GPIO_WritePin(GPIOA, GPIO_PIN_6, GPIO_PIN_RESET);
    }

    tx_active = false;
    HAL_TIM_Base_Stop(&htim2); // optional: stop TIM2 base to save a few µA

    HAL_DAC_SetValue(&hdac1, DAC_CHANNEL_1, DAC_ALIGN_12B_R, MID_12B);
  }
}

